#include <stdio.h>

 int main() {

    printf("+------------+-------+-------+-------+\n"); //แสดงหัวตาราง
    int i = 1, j = 2, k;  // กำหนดค่าตัวแปร i, j และ k
    printf("| Expression | i = %d | j = %d |k = %d|\n", i , j , k); // แสดงค่าตัวแปร i, j และ k
    printf("+---------=--+-------+-------+-------+\n"); // แสดงเส้นแบ่งตาราง
    k = i + j; // คำนวณค่า k เป็นผลรวมของ i และ j
    printf("|k=i+j       |%7d|%7d|%7d|\n",i, j, k); // แสดงผลลัพธ์ของ k ชึ่งเป็นผลรวมของ i และ j = 1 + 2 = 3
    printf("|------------|-------|-------|-------|\n"); // แสดงเส้นแบ่งตาราง
    i = i + ( k * j ); // คำนวณค่า i ใหม่ โดยนำค่า k คูณกับ j แล้วบวกกับ i
    printf("|i=i+(k*j)   |%7d|%7d|%7d|\n",i, j, k); // แสดงผลลัพธ์ของ i ซึ่งเป็นผลรวมของ i + (k * j) = 1 + (3 * 2) = 7
    printf("|------------|-------|-------|-------|\n"); // แสดงเส้นแบ่งตาราง
    j = i/2; // คำนวณค่า j ใหม่ โดยนำค่า i หารด้วย 2
    printf("|j=i/2       |%7d|%7d|%7d|\n",i, j, k); // แสดงผลลัพธ์ของ j ซึ่งเป็นผลลัพธ์ของ i หารด้วย 2 = 7 / 2 = 3
    printf("|------------|-------|-------|-------|\n"); // แสดงเส้นแบ่งตาราง
    k = i % 2; // คำนวณค่า k ใหม่ โดยนำค่า i หารเอาเศษด้วย 2
    printf("|k=i%%2       |%7d|%7d|%7d|\n",i, j, k); // แสดงผลลัพธ์ของ k ซึ่งเป็นเศษของ i หารด้วย 2 = 7 % 2 = 1
    printf("|------------|-------|-------|-------|\n"); // แสดงเส้นแบ่งตาราง
    i = (j + k) * 3; // คำนวณค่า i ใหม่ โดยนำค่า j และ k บวกกันแล้วคูณด้วย 3
    printf("|i=(j+k)*3   |%7d|%7d|%7d|\n",i, j, k); // แสดงผลลัพธ์ของ i ซึ่งเป็นผลลัพธ์ของ (j + k) * 3 = (3 + 1) * 3 = 12
    printf("+------------+-------+-------+-------+\n"); /// แสดงเส้นแบ่งตาราง


    return 0;
 }