#include <stdio.h>

 int main() {

    printf("+-------------+----------+----------+----------+\n"); // แสดงหัวตาราง
    double x = 1.0, y = 2.0, z; // กำหนดค่าตัวแปร x, y และ z โดย x และ y เป็นจำนวนทศนิยม
    printf("|  Expression |  x = %.2f|  y = %.2f|  z = %.2f|\n", x , y , z); // แสดงค่าตัวแปร x, y และ z
    printf("+-------------+----------+----------+----------+\n"); // แสดงเส้นแบ่งตาราง
    x = y + 5.0; // คำนวณค่า x ใหม่ โดยนำค่า y บวกกับ 5.0 
    printf("|x=y+5.0      |%10.2f|%10.2f|%10.2f|\n",x, y, z); // แสดงผลลัพธ์ของ x ซึ่งเป็นผลรวมของ y + 5.0 = 2.0 + 5.0 = 7.0
    printf("|-------------|----------|----------|----------|\n"); // แสดงเส้นแบ่งตาราง
    y = x / 2.0; // คำนวณค่า y ใหม่ โดยนำค่า x หารด้วย 2.0
    printf("|y=x+2.0      |%10.2f|%10.2f|%10.2f|\n",x, y, z); // แสดงผลลัพธ์ของ y ซึ่งเป็นผลลัพธ์ของ x หารด้วย 2.0 = 7.0 / 2.0 = 3.5
    printf("|-------------|----------|----------|----------|\n"); // แสดงเส้นแบ่งตาราง
    y = (x * 3.0) + 4.0; // คำนวณค่า y ใหม่ โดยนำค่า x คูณด้วย 3.0 แล้วบวกกับ 4.0
    printf("|y=(x*3.0)+4.0|%10.2f|%10.2f|%10.2f|\n",x, y, z); // แสดงผลลัพธ์ของ y ซึ่งเป็นผลลัพธ์ของ (x * 3.0) + 4.0 = (7.0 * 3.0) + 4.0 = 21.0 + 4.0 = 25.0
    printf("|-------------|----------|----------|----------|\n"); // แสดงเส้นแบ่งตาราง
    x = -0.5 - y; // คำนวณค่า x ใหม่ โดยนำ -0.5 ลบด้วยค่า y
    printf("|x=-0.5-y     |%10.2f|%10.2f|%10.2f|\n",x, y, z); // แสดงผลลัพธ์ของ x ซึ่งเป็นผลลัพธ์ของ -0.5 - y = -0.5 - 25.0 = -25.5
    printf("|-------------|----------|----------|----------|\n"); // แสดงเส้นแบ่งตาราง
    z = x = y; // คำนวณค่า z และ x ใหม่ โดยนำค่า y กำหนดให้กับ z และ x
    printf("|z=x+y        |%10.2f|%10.2f|%10.2f|\n",x, y, z); // แสดงผลลัพธ์ของ z และ x ซึ่งเป็นผลลัพธ์ของ x = y = 25.0
    printf("+-------------+----------+----------+----------+\n"); // แสดงเส้นแบ่งตาราง

    return 0;
 }